blog/2021/nginx-80-http2.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 12:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Nginx 中在 80 端口添加 HTTP/2 出现问题</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Nginx 中在 80 端口添加 HTTP/2 出现问题</h1>
</header><p>
承接上篇文章<a href="nginx-http2.html">通过 Nginx 让网站支持 HTTP/2</a>，当我完成文章中的操作时，有一次我好奇网站 HTTP 是否能够自动跳转到 HTTPS，于是我输入 <code>http://blog.yidajiabei.xyz/</code> ，意外发生了——没有跳转到
HTTPS，还下载了一个名字为 <code>download</code> 且文件类型为 <code>application/octet-stream</code> 。
</p>

<p>
我很意外，思考这是为什么。把这个问题记下来，过了几个小时，我从网络中找到答案：HTTP2 不需要加密<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>，当然这只是肤浅的说法，一定还有深层次的理解。
</p>

<p>
通过这篇文章<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，我学到一条检查网站是否支持 HTTP/2 的命令：
</p>

<div class="org-src-container">
<pre class="src src-sh">curl -I -k --http2 https://blog.yidajiabei.xyz/
HTTP/2 200 
server: nginx/1.18.0 (Ubuntu)
date: Wed, 03 Nov 2021 00:37:29 GMT
content-type: text/html
content-length: 5254
last-modified: Tue, 02 Nov 2021 23:37:46 GMT
etag: <span style="color: #ddbc91;">"6181cbca-1486"</span>
accept-ranges: bytes
</pre>
</div>

<p>
在这篇文章中，我找到了 Nginx 配置 HTTP/2 的方法：
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #ad8572;">http</span> {
  <span style="color: #ad8572;">server</span> {
    listen 443 ssl http2 default_server;
    ssl_certificate    /path/to/server.cert;
    ssl_certificate_key /path/to/server.key;
    <span style="color: #706565;"># </span><span style="color: #857575;">...</span>
    <span style="color: #706565;"># </span><span style="color: #857575;">Copy from the HTTP server</span>
    <span style="color: #706565;"># </span><span style="color: #857575;">...</span>
  }
}
</pre>
</div>

<p>
根据这一配置，再联系到 HTTP/2 不需要加密，那么是不是不能在 80 端口配置 HTTP/2 呢？也就是说，以下配置会造成无法由 HTTP 跳转到 HTTPS：
</p>

<div class="org-src-container">
<pre class="src src-conf"><span style="color: #ad8572;">http</span> {
  <span style="color: #ad8572;">server</span> {
    listen 80 http2;
    <span style="color: #706565;"># </span><span style="color: #857575;">...</span>
  }
}
</pre>
</div>

<p>
当这一切都被修正时，HTTP 就能够跳转到 HTTPS 了。
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://http2.github.io/faq/#does-http2-require-encryption">https://http2.github.io/faq/#does-http2-require-encryption</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://dassur.ma/things/h2setup/">https://dassur.ma/things/h2setup/</a></p></div></div>


</div>
</div></div>
</body>
</html>